"""
Напишите генератор выводящий все символы строки на печать, но только в том случае, если они являются буквами (остальные игнорируются).
"""
def generator():
    x = "asd"
    if str(x):
        print(x)
